src/InformationRegisters/инкНовости/инкНовости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>инкНовости</name>
  <resources>
    <name>Прочитано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>НомерНовости</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ВебСсылка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/инкНовости/Forms/ФормаЧтенияНовостей/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	инкНовостиСервер.ЗагрузитьНовостиССайта();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)      

	ИндексНовости = 0;
	МассивНовостей = ПолучитьНовостиДляОтображения(); 
	
	Для каждого НовостьЭлемент Из МассивНовостей Цикл
		НовостиДляОтображенияСтрока = НовостиДляОтображения.Добавить();
		ЗаполнитьЗначенияСвойств(НовостиДляОтображенияСтрока,НовостьЭлемент);
	КонецЦикла;
	
	Если НовостиДляОтображения.Количество() = 0 Тогда
		Отказ = Истина;
	Иначе
		ИндексНовости = НовостиДляОтображения.Количество() - 1;
		ОтображениеЭлементовНаФорме();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущаяНовость(Команда)
	
	ИндексНовости = ИндексНовости - 1;
	ОтображениеЭлементовНаФорме();

КонецПроцедуры   

&НаКлиенте
Процедура СледующаяНовость(Команда)
	
	ИндексНовости = ИндексНовости + 1;
	ОтображениеЭлементовНаФорме();

КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьВсеИЗакрыть(Команда)
	
	ЗаписатьДанныеВРегистр();
	Закрыть();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьДанныеВРегистр()

	Для каждого НовостьСтрока Из НовостиДляОтображения Цикл
		
		МенедрежЗаписи = РегистрыСведений.инкНовости.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенедрежЗаписи,НовостьСтрока);
		МенедрежЗаписи.Прочитано = Истина;
		МенедрежЗаписи.Записать(Истина);
		
	КонецЦикла;        
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНовостиДляОтображения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	инкНовости.НомерНовости КАК НомерНовости,
		|	инкНовости.ВебСсылка КАК ВебСсылка,
		|	ИСТИНА КАК ВыборСтроки
		|ИЗ
		|	РегистрСведений.инкНовости КАК инкНовости
		|ГДЕ
		|	НЕ инкНовости.Прочитано";
	

	РезультатЗапроса = инкОбщийСервер.ПреобразоватьТаблицуЗначенийВМассив(Запрос.Выполнить().Выгрузить());
	
	Возврат РезультатЗапроса;	
	
КонецФункции

&НаКлиенте
Процедура ОтображениеЭлементовНаФорме()
	
	Элементы.ФормаПредыдущаяНовость.Доступность = НЕ (ИндексНовости = 0);
	Элементы.ФормаСледующаяНовость.Доступность = НЕ (ИндексНовости = НовостиДляОтображения.Количество() - 1);
	
	НовостьОтображение = НовостиДляОтображения[ИндексНовости].ВебСсылка; 
	
КонецПроцедуры

#КонецОбласти
